/**
 * на вход ф-ция получет 2 числа n, maxAttempts
 * n - максимальное число, maxAttemps - максимальное кол-во попыток угадывания
 * ф-ция генерирует псевдослучайное счисло между 1 и n
 * далее у пользователя есть maxAttemps попыток это число угадать
 * ф-ция должна запрашивать у пользователя число, через ./components/promptModal
 * если пользователь угадал число - вернуть true, если все попытки использованы и число не угадано - false
 */

const asyncLoop = {
    async guessNumber(n, maxAttempts) { },
};